---

C#Visual BasicVisual C++

Revit 2024 API
---
FluidType..::..GetEnumerator Method
FluidType Class See Also Send Feedback
---

Returns an enumerator that iterates through a collection.

**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)

# Syntax

C#
---

    public virtual IEnumerator<FluidTemperature> GetEnumerator()

Visual Basic
---

    Public Overridable Function GetEnumerator As IEnumerator(Of FluidTemperature)

Visual C++
---

    public:
    virtual IEnumerator<FluidTemperature^>^ GetEnumerator()

#### Return Value

An IEnumerator object that can be used to iterate through the collection.

#### Implements

IEnumerable<(Of <(<'T>)>)>..::..GetEnumerator()()()()

# See Also

FluidType Class

Autodesk.Revit.DB.Plumbing Namespace